astb_relise/src/Documents/ПриказНаПроведениеМедицинскихОсмотров/ПриказНаПроведениеМедицинскихОсмотров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказНаПроведениеМедицинскихОсмотров</name>
  <registerRecords>InformationRegister.ПриказыНаПроведениеМедицинскихОсмотров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РабочиеМеста</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиИПрофессии</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаАСТБ</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/AccumulationRegisters/ЗанятыеРабочиеМеста/ЗанятыеРабочиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗанятыеРабочиеМеста</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/InformationRegisters/ВредныеИОпасныеФакторыИРаботыНаРабочихМестах/ВредныеИОпасныеФакторыИРаботыНаРабочихМестах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВредныеИОпасныеФакторыИРаботыНаРабочихМестах</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ФакторРабота</name>
    <type>
      <types>CatalogRef.ВредныеИОпасныеПроизводственныеФакторы</types>
      <types>CatalogRef.ВредныеИОпасныеПроизводственныеРаботы</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФакторИлиРабота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СлужебноеИзмерение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Documents/ПриказНаПроведениеМедицинскихОсмотров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриказНаПроведениеМедицинскихОсмотровРабочиеМеста.Ссылка.Дата КАК Период,
	|	ПриказНаПроведениеМедицинскихОсмотровРабочиеМеста.Ссылка.Организация КАК Организация,
	|	ПриказНаПроведениеМедицинскихОсмотровРабочиеМеста.Подразделение КАК Подразделение,
	|	ПриказНаПроведениеМедицинскихОсмотровРабочиеМеста.Должность КАК Должность,
	|	ПриказНаПроведениеМедицинскихОсмотровРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	ПриказНаПроведениеМедицинскихОсмотровРабочиеМеста.Проводить КАК Проводить
	|ИЗ
	|	Документ.ПриказНаПроведениеМедицинскихОсмотров.РабочиеМеста КАК ПриказНаПроведениеМедицинскихОсмотровРабочиеМеста
	|ГДЕ
	|	ПриказНаПроведениеМедицинскихОсмотровРабочиеМеста.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	ТаблицыДляДвижений.Вставить("ТаблицаПриказыНаПроведениеМедицинскихОсмотров", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

//процедура заполняет табличную часть "Рабочие места"
//Параметры:
//ТекущийОбъект - текущий документ-объект для заполнения
//МассивЗначений - массив выбранных значений
//ПараметрЗаполнения - строка, может принимать значения:
//1. "П"	- заполнение по подразделеням согласно специальной оценке рабочих мест
//2. "Д"	- заполнение по должностям согласно специальной оценке рабочих мест
//3. "РМ" 	- заполнение по рабочим местам согласно специальной оценке рабочих мест
Процедура ЗаполнитьРабочиеМеста(ТекущийОбъект, МассивЗначений, ПараметрЗаполнения) Экспорт
	
	ДатаАнализа = ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАнализа",	ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",	ТекущийОбъект.Организация);	
	Запрос.УстановитьПараметр("МассивЗначений",	МассивЗначений);
		
	Если ПараметрЗаполнения = "П" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Подразделение КАК Подразделение,
		|	ЗанятыеРабочиеМестаОстатки.Должность КАК Должность,
		|	ЗанятыеРабочиеМестаОстатки.РабочееМесто КАК РабочееМесто,
		|	ИСТИНА КАК Проводить
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И Подразделение В (&МассивЗначений)) КАК ЗанятыеРабочиеМестаОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВредныеИОпасныеФакторыИРаботыНаРабочихМестах.СрезПоследних(&ДатаАнализа, Организация = &Организация) КАК ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних
		|		ПО (ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|				ИЛИ ЗанятыеРабочиеМестаОстатки.Подразделение = ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Подразделение)
		|			И (ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
		|				ИЛИ ЗанятыеРабочиеМестаОстатки.Должность = ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Должность)
		|			И (ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РАбочиеМестаАСТБ.ПустаяСсылка)
		|				ИЛИ ЗанятыеРабочиеМестаОстатки.РабочееМесто = ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.РабочееМесто)
		|ГДЕ
		|	НЕ ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.ФакторРабота ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗанятыеРабочиеМестаОстатки.Подразделение.Наименование,
		|	ЗанятыеРабочиеМестаОстатки.Должность.Наименование,
		|	ЗанятыеРабочиеМестаОстатки.РабочееМесто.Наименование";
		
	ИначеЕсли ПараметрЗаполнения = "Д" Тогда	
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Подразделение КАК Подразделение,
		|	ЗанятыеРабочиеМестаОстатки.Должность КАК Должность,
		|	ЗанятыеРабочиеМестаОстатки.РабочееМесто КАК РабочееМесто,
		|	ИСТИНА КАК Проводить
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И Должность В (&МассивЗначений)) КАК ЗанятыеРабочиеМестаОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВредныеИОпасныеФакторыИРаботыНаРабочихМестах.СрезПоследних(&ДатаАнализа, Организация = &Организация) КАК ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних
		|		ПО (ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|				ИЛИ ЗанятыеРабочиеМестаОстатки.Подразделение = ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Подразделение)
		|			И (ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
		|				ИЛИ ЗанятыеРабочиеМестаОстатки.Должность = ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Должность)
		|			И (ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РАбочиеМестаАСТБ.ПустаяСсылка)
		|				ИЛИ ЗанятыеРабочиеМестаОстатки.РабочееМесто = ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.РабочееМесто)
		|ГДЕ
		|	НЕ ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.ФакторРабота ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗанятыеРабочиеМестаОстатки.Подразделение.Наименование,
		|	ЗанятыеРабочиеМестаОстатки.Должность.Наименование,
		|	ЗанятыеРабочиеМестаОстатки.РабочееМесто.Наименование";
		
	ИначеЕсли ПараметрЗаполнения = "РМ" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗанятыеРабочиеМестаОстатки.Подразделение КАК Подразделение,
		|	ЗанятыеРабочиеМестаОстатки.Должность КАК Должность,
		|	ЗанятыеРабочиеМестаОстатки.РабочееМесто КАК РабочееМесто,
		|	ИСТИНА КАК Проводить
		|ИЗ
		|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
		|			&ДатаАнализа,
		|			Организация = &Организация
		|				И РабочееМесто В (&МассивЗначений)) КАК ЗанятыеРабочиеМестаОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВредныеИОпасныеФакторыИРаботыНаРабочихМестах.СрезПоследних(&ДатаАнализа, Организация = &Организация) КАК ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних
		|		ПО (ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|				ИЛИ ЗанятыеРабочиеМестаОстатки.Подразделение = ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Подразделение)
		|			И (ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
		|				ИЛИ ЗанятыеРабочиеМестаОстатки.Должность = ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Должность)
		|			И (ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РАбочиеМестаАСТБ.ПустаяСсылка)
		|				ИЛИ ЗанятыеРабочиеМестаОстатки.РабочееМесто = ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.РабочееМесто)
		|ГДЕ
		|	НЕ ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.ФакторРабота ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗанятыеРабочиеМестаОстатки.Подразделение.Наименование,
		|	ЗанятыеРабочиеМестаОстатки.Должность.Наименование,
		|	ЗанятыеРабочиеМестаОстатки.РабочееМесто.Наименование";
		
	Иначе
		
		Возврат;
		
	КонецЕсли;	
		
	ТекущийОбъект.РабочиеМеста.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры	

#КонецЕсли
